Revit 2027 API
ExternalResourceServerUtils.ServerSupportsAssemblyCodeData Method
 Checks that the server referenced by the given ExternalResourceReference supports AssemblyCodeData.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ServerSupportsAssemblyCodeData(
	ExternalResourceReference extRef
)
Public Shared Function ServerSupportsAssemblyCodeData (
	extRef As ExternalResourceReference
) As Boolean
public:
static bool ServerSupportsAssemblyCodeData(
	ExternalResourceReference^ extRef
)
static member ServerSupportsAssemblyCodeData :
        extRef : ExternalResourceReference -> bool
Parameters
extRef ExternalResourceReference
 The ExternalResourceReference to check.
Return Value
Boolean
 True if the ExternalResourceReference refers to a server that supports AssemblyCodeData. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceServerUtils Class
Autodesk.Revit.DB Namespace